#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_sns_topic.user_updates: Refreshing state... [id=arn:aws:sns:us-east-1:961732110118:user-updates-topic]
aws_ssm_parameter.ssm_parameter: Refreshing state... [id=foo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic.user_updates must be replaced
-/+ resource "aws_sns_topic" "user_updates" {
      - application_success_feedback_sample_rate = 0 -> null
      ~ arn                                      = "arn:aws:sns:us-east-1:961732110118:user-updates-topic" -> (known after apply)
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      ~ id                                       = "arn:aws:sns:us-east-1:961732110118:user-updates-topic" -> (known after apply)
      - lambda_success_feedback_sample_rate      = 0 -> null
      ~ name                                     = "user-updates-topic" -> "usersnsnotificationgit" # forces replacement
      + name_prefix                              = (known after apply)
      ~ owner                                    = "961732110118" -> (known after apply)
      ~ policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "961732110118"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:961732110118:user-updates-topic"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> (known after apply)
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      ~ tags_all                                 = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @carinew, Action: `pull_request`*